"use strict";

// ## Example 1 - Базові математичні операції

// Виведи на екран загальну кількість яблук і винограду. Різницю я та винограду

// ## Example 4 - Клас Math

// Напиши код який виводить в консоль округлення вверх / вниз.Використовуй методи`Math.floor()`,
// `Math.ceil()` і`Math.round()`.
// Math.ceil;
// Math.floor;
// Math.round;
// Math.pow
// Math.sqrt

// ## Example 5 - Шаблонні рядки

// Склади фразу`A has B bots in stock`, де A, B - це змінні

// ```js
// const companyName = "Cyberdyne Systems";
// const repairBots = 150;
// const defenceBots = 50;

// ```

// ## Example 7 - Опертор % та методы рядків

// Напиши код який переводить значення`totalMinutes`(кількість хвилин) в формат
//  `HH:MM`

// - 70 покаже 01:10
// - 450 покаже 07:30
// - 1441 покаже 24:01

// ## Example 8 - Логічні оператори

// Яким буде результат виразу

// && - name === 'user' && login === 'admin' // всі true, зупиняється тоді коли будь - яка дасть false
// || - name === 'user' || login === 'admin' // перший true який знайдемо , або останій flase в ланцюжку

// Використовуючи конструкцію if...else та prompt напишіть код що буде питатися в користувача
// "Яка офіційна назва JavaScript".Якщо користувач вводить `ECMAScript` то показувати alert з повідомленням`"Вірно!"`
// в іншому випадку - "Не знаєте? ECMAScript"

// const userInput = prompt("Яка офіційна назва JavaScript");

// ## Example 2 - Показувати час(if...else)

// Напишіть код для відображення годин і хвилин в консоль браузера в вигляді рядка в форматі "14 год 26 хв"
// Якщо значення хвилин "0" тоді показувати лише "14 год"

// ## Example 3 - Розгалуження

// Напишіть код що виводить в консоль рядок "Це додатнє число" якщо користувач ввів в prompt число що більше за 0
// Якщо користувач ввів 0 то рядок "Це нуль". Якщо користувач ввів відємне число виводити на екран рядок "Це відємне число"

// ```

// ## Example 4 - if...else і логічні оператори

// Напишіть код що буде виводити в консоль браузера рядок в залежності від значення змінної "hours"

// Якщо занчення зміної `hours`:

// - меньше `17`, виводимо рядок `"Pending"`
// - більше чи доріврнює `17` і меньше чи дорівнює 24, виводимо рядок `"Expires"`
// - більше `24` , виводимо рядок `"Overdue"`

// ## Example 5 - Дедлайн здачі проекта(if...else)

// Напиши код для відображення часу дедлайна здачі проекта. Використовуй if else

// - Якщо до дедлайну 0 днів - виведи рядок `"Сьогодні"`
// - Якщо до дедлайну 1 день - виведи рядок `"Завтра"`
// - Якщо до дедлайну 2 дні - виведи рядок `"Післязавтра"`
// - Якщо до дедлайну 3+ днів - виведи рядок `"Ще не скоро )"`

// ## Example 6 - Переписати задачу 5 на Switch

// }
// ## Example 7 - Цикл for

// змінна що відповідає за старт циклу
// умова що відповідає за припинення циклу
// код який наближає закінчення циклу

// Написати цикл що виводить в консоль числа від меньшого до більшого в діапазоні від min до max
// але лише ті що кратні 5-ти

// ## Example 8
//  Написати гру камінь - ножиці - папір
// Де компютер загадує своє значення
// Користувач вводить свій варіант
// І потім ми бачимо хто переміг

// 1) Дізнатися варіант компютера
// 2) Дізнатися варіант користувача
// 3) Перевірити і визначити переможця

//----------------------------------

// # Модуль 2. Заняття 3. Масиви

// ## Example 1 - Базові операції з масивом

// Створити масив `genres` з елементами «Jazz» и «Blues»
// Додайте «Рок - н - ролл» в кінець масиву
// Виведіть в консоль перший елемент
// Виведіть в консоль останній елемент
// Видаліть перший елемент
// Вставте  «Country» та  «Reggy» в початок масиву

// ## Example 2 - Масиви і рядки

// Напиши код для розрахунку площі прямокутника зі сторонами, значення яких зберігаються в рядку

// ## Example 3 - Перебор масиву

// Напишіть код для перебору масиву циклом for для кожного елементу виведіть в консоль рядок в форматі
// 'номер елементу: значення елементу'

// ```js
// const fruits = ["🍎", "🍇", "🍑", "🍌", "🍋"];
// let num = 0;

// ## Example 4 - Масиви  та цикли

// Напишіть скрипт який виводить в консоль імя та телефон кожного користувача

// ## Example 5 - Массивы и строки

// Напишіть скрипт що розвертає рядок в зворотньому напрямку

// ## Example 6 - Пошутк елемента масиву

// Напиши код для пошуку елемента в масиві і виведіть його в консоль

// # Модуль 2. Заняття 4. Функції

// ## Example 1 - Меньше з чисел

// Напиши ф-ю яка буде повертати меньше з двох чисел "a" та "b"

//

// ## Example 2 - Площа прямокутника

// Напиши ф - ю`getRectArea(dimensions)`яка буде рахувати площу прямокутника зі сторонами, значення яких
// буде записано в `dimensions` в форматі рядка
// let diametr = 1;

// ## Example 3 - Показ елементів в консоль

// Напиши ф - ю`logItems(items)` що отримує масив та використовує цикл і для кожного елементу виводить
// `<номер елемента> - <значеня елемента>` Нумерація починається з 1

// logItems(["Mango", "Poly", "Ajax"]);
// logItems(["🍎", "🍇", "🍑", "🍌", "🍋"]);

// ```

// ## Example 4 - Пошук найбільшого елементу

// Напишіть ф-ю `findLargestNumber(numbers)` яка шукає саме більше число в масиві

// console.log(findLargestNumber([2, 17, 94, 1, 23, 37])); // 94
// console.log(findLargestNumber([49, 4, 7, 83, 12])); // 83
// console.log(findLargestNumber([-2, 0, 3, 5, 7])); // 7

// ```

// ## Example 5 - Середнє значення

// Напиши ф-ю `calAverage()` яка приймає будь-яку кількість аргументів і повертає їх середнє значення
// let midleNumber = 0;

// ## Example 6 - Форматування часу

// Напиши ф-ю `formatTime(minutes)` яка перетворює значення `minutes` в рядок формату "HH:MM"

// ## Example 7 - Колекції курсів (includes, indexOf, push ...)

// Напишіть ф - ї для роботи з колекціями курсів`courses`

// - `addCourse(name)` - додає курс в кінець колекції
// - `removeCourse(name)` - видаляє курс з колекції
// - `updateCourse(oldName, newName)` - міняє назву курсу на нову

// console.log(addCourse("Express"));
// console.log(courses); // ['HTML', 'CSS', 'JavaScript', 'React', 'PostgreSQL', 'Express']
// console.log(addCourse("CSS")); // 'У Вас уже є такий курс'

// removeCourse("React");
// console.log(courses); // ['HTML', 'CSS', 'JavaScript', 'PostgreSQL', 'Express']
// console.log(removeCourse("Vue")); // 'Курс з такою назвою відсутній'

// console.log(updateCourse("Express", "NestJS"));
// updateCourse("Express", "NestJS");
// console.log(courses); // ['HTML', 'CSS', 'JavaScript', 'PostgreSQL', 'NestJS']
// ```

// --------------------111
//111
/*
 * Перевірити, чи є число цілим
 */

// const number = 9;

//22222
/*
 * Волонтери розділені на 5 груп з рівною кількістю людей у кожній. 
Якщо в будь-якій групі по 5 осіб, то для відновлення кількості необхідно набрати ще волонтерів.
 Напишіть програму, яка бере фактичну кількість волонтерів як вступні дані і виводить 
 у консоль кількість волонтерів, яку необхідно найняти, щоб у всіх 5 групах їх було порівну.
 */

// const volunteers = 46; // Фактична кількість волонтерів
// const grup = 5; // Кількість груп

//3333
/*
 * Перепишіть конструкцію if за допомогою тернарного оператора
 */
// if (a + b < 4) {
//   console.log('мало');
// } else {
//   console.log('багато');
// }

//55555
/*
 * У змінній min лежить число від 0 до 59.Визначте, в яку чверть години потрапляє це число (у першу, другу, третю чи четверту).
 */
// const min = 59;
// const time = 60;
// const quarter = time / 4;

//66666
/*
 * Дано рядок, що складається із символів, наприклад, '  abcde '. 
Перевірте, що першим символом цього рядка є буква 'a'. Якщо це так - виведіть 'так', інакше - виведіть 'ні'.
 
 */
// const string = 'a  abcde ';

//444444
/*
 * Напиши скрипт, який просить відвідувача ввести число у prompt до тих пір, поки відвідувач натисне Cancel та щоразу додає введене значення до загальної суми.

 * При завантаженні сторінки користувачеві пропонується в prompt ввести число. Введення додається до значення змінної total.

 * Операція введення числа триває доти, доки користувач не натисне кнопку Cancel у prompt.

 * Після того, як користувач припинив введення, натиснувши кнопку Cancel, показати alert з рядком 'Загальна сума чисел дорівнює [сума]'.
 * Робити перевірку того, що користувач ввів саме число, а не довільний набір символів, не потрібно. Якщо хочеш, у разі некоректного введення, показуй alert з текстом 'Було введено не число, спробуйте ще раз', при цьому результат prompt плюсувати до загальної суми не потрібно, після чого користувачеві знову пропонується ввести число в prompt.
 */

// const inputNumber = prompt();
// let total = 0;

//777777
/*
 * Наше завдання - визначити характер зазначеного речення
 */

// getSenescenceType('Я бачив у місті такого ж представника, як ти');
// getSenescenceType('Чи бачив ти у місті такого ж представника, як я?');
// getSenescenceType('Вибач, але я не в курсі хто ти такий...');

//88888
/*
 * Ставка податку залежить від розміру твого доходу:
 * якщо дохід до 1000 грн. включно — податок 2%;
 * якщо дохід від 1000 грн. до 10000 грн. включно — податок 3%;
 * якщо дохід більший за 10000 грн — податок 5%;
 */

// const salary = 102300;
// let tax = 0;

//9999
/*
 * Скрипт приймає 1 сторону (side) і діагональ (diagonal) прямокутника.
 Перевір це прямокутник (діагональ не може бути менше сторони прямокутника). 
 Поверни площу цього прямокутника або рядок not a rectangle, якщо це не прямокутник. 
 Якщо результат не ціле число, округли значення до 2 знаків після коми.
 */
// const side = 5;
// const diagonal = 6;
// let area = 0;

//10
/*
 * Який сьогодні день тижня?

 */
// const today = new Date();

// console.log(`Сьогодні ${today}`);

// -------------------- 222222
//* Рубрика 'wtf!?' або "Що покаже консоль?"

// function a(value) {
//   return true - value;
// }

// const b = a('4') + a('-4') + a('-4') + a(4);
// console.log(b);

// const numbers = [17, 2222, 94, 11, 3];

//2222
/*
 * Є масив із числами. Створіть із нього новий масив, де залишаться лежати лише позитивні числа. Створіть для цього допоміжну функцію isPositive(), яка параметром прийматиме число і повертатиме true, якщо число позитивне, і false - якщо негативне.
 */

//3333
/*
 * Є двомірний масив з числами, наприклад [[1, 2, 3], [4, 5], [6]]. Знайдіть суму елементів цього масиву. Масив, звичайно, може бути довільним.
 */

// 4444
/*
 * Потрібно написати функцію, яка приймає рядок як аргумент і повертає кількість голосних, які містяться в рядку.
 * Гласними є "a", "e", "i", "o", "u".
 */

//555
/*
 * Створи функцію getLargestExpressionResult, яка приймає два числа a та b і повертає найбільший можливий результат серед виразів:
a + b
a — b
a * b
a / b
 */

//6666
/*
 * Потрібно написати функцію яка приймає рядок і перевіряє є чи рядок абеткою
 */

//7777
/*
 * Як знайти суму елементів масиву, якщо вкладеність масиву невідома?
 */

// console.log(arraySum([[1, 2, [3, 4]], [9], [10, 12]]));

//8888
/*
 * Є масив із числами. Виведіть послідовно його елементи, використовуючи рекурсію і не використовуючи цикл.
 */

// const array = [1, 2, 3, 4, 5, 6, 7, 8, 9];

//9999
/*
 * Паліндром - слово, речення чи послідовність символів, яка абсолютно однаково читається як у звичному напрямку, так і у зворотному. Наприклад, "Anna" - це паліндром, а "table" і "John" - ні.
 * Даний рядок; потрібно написати функцію, яка дозволяє повернути значення true, якщо рядок є паліндром, і false - якщо ні. При цьому потрібно враховувати прогалини та розділові знаки.
 */

//10000
/*
 * Є масив logins з логінами користувачів. Напиши скрипт додавання логіну до масиву logins. Доданий логін повинен:

* проходити перевірку на довжину від 4 до 16 символів включно
* бути унікальним, тобто відсутнім у масиві logins

* Розбий завдання на підзавдання за допомогою функцій.

* Напиши функцію isLoginValid(login), в якій перевір кількість символів параметра login і поверни true або false в залежності від того, чи довжина параметра потрапляє в заданий діапазон від 4-х до 16-ти символів включно.

* Напиши функцію isLoginUnique(allLogins, login), яка приймає список всіх логінів і логін, що додається, як параметри і перевіряє наявність login в масиві allLogins, повертаючи true якщо такого логіну ще немає і false якщо логін вже використовується.

* Напиши функцію addLogin(allLogins, login) яка:

* Приймає новий логін та масив усіх логінів як параметри
* Перевіряє валідність логіна використовуючи допоміжну функцію isLoginValid
* Якщо логін не валідний, припинити виконання функції addLogin і повернути рядок 'Помилка! Логін має бути від 4 до 16 символів'
* Якщо логін валіден, функція addLogin перевіряє унікальність логіну за допомогою функції isLoginUnique

* Якщо isLoginUnique поверне false, тоді addLogin не додає логін до масиву і повертає рядок 'Такий логін вже використовується!'
* Якщо isLoginUnique поверне true, addLogin додає новий логін в logins і повертає рядок 'Логін успішно доданий!'
* Принцип єдиної відповідальності функції - кожна функція робить щось одне. Це дозволяє перевикористовувати код і змінювати логіку роботи функції лише в одному місці, не торкаючись роботи програми в цілому.

* Предикатні функції повертають лише true або false. Такі функції прийнято називати з is: isLoginUnique і isLoginValid у нашому випадку.

* isLoginUnique тільки перевіряє, чи є такий логін в масиві і повертає true або false.
* isLoginValid тільки перевіряє чи валідний логін і повертає true або false.
* addLogin додає або не додає логін до масиву. При цьому для перевірок умови додавання використовує результати викликів інших функцій - isLoginUnique та isLoginValid.

 */
